#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_s3_bucket.cdn_bucket: Refreshing state... [id=last-dram-cdn]
aws_dynamodb_table.bottles-table: Refreshing state... [id=Bottles]
aws_appsync_graphql_api.last-dram-api: Refreshing state... [id=u6dc5ni4yrbabooim4i24edtd4]
aws_iam_role.last-dram-dynamodb-role: Refreshing state... [id=last-dram-dynamodb-role]
aws_cognito_user_pool.last-dram-user-pool: Refreshing state... [id=us-east-1_CUtQR75De]
aws_appsync_api_key.api-key: Refreshing state... [id=u6dc5ni4yrbabooim4i24edtd4:da2-l7naysv2rvgu5o3ct5yevjkf4i]
aws_cognito_user_pool_client.client: Refreshing state... [id=5895or4do2dt98m6sjh963eer2]
aws_iam_role_policy.last-dram-dynamodb-policy: Refreshing state... [id=last-dram-dynamodb-role:last-dram-dynamodb-policy]
aws_appsync_datasource.bottles-datasource: Refreshing state... [id=u6dc5ni4yrbabooim4i24edtd4-bottles_datasource]
aws_appsync_resolver.getBottle-resolver: Refreshing state... [id=u6dc5ni4yrbabooim4i24edtd4-Query-getBottle]
aws_appsync_resolver.deleteBottle-resolver: Refreshing state... [id=u6dc5ni4yrbabooim4i24edtd4-Mutation-deleteBottle]
aws_appsync_resolver.listBottles-resolver: Refreshing state... [id=u6dc5ni4yrbabooim4i24edtd4-Query-listBottles]
aws_appsync_resolver.updateBottle-resolver: Refreshing state... [id=u6dc5ni4yrbabooim4i24edtd4-Mutation-updateBottle]
aws_appsync_resolver.createBottle-resolver: Refreshing state... [id=u6dc5ni4yrbabooim4i24edtd4-Mutation-createBottle]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_cognito_user_pool.last-dram-user-pool has changed
  ~ resource "aws_cognito_user_pool" "last-dram-user-pool" {
      ~ estimated_number_of_users = 0 -> 6
        id                        = "us-east-1_CUtQR75De"
        name                      = "last-dram-user-pool"
        tags                      = {}
        # (7 unchanged attributes hidden)







        # (7 unchanged blocks hidden)
    }

  # aws_dynamodb_table.bottles-table has changed
  ~ resource "aws_dynamodb_table" "bottles-table" {
        id             = "Bottles"
        name           = "Bottles"
      + tags           = {}
        # (7 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_iam_role.last-dram-dynamodb-role has changed
  ~ resource "aws_iam_role" "last-dram-dynamodb-role" {
        id                    = "last-dram-dynamodb-role"
        name                  = "last-dram-dynamodb-role"
        tags                  = {}
        # (9 unchanged attributes hidden)

      - inline_policy {}
      + inline_policy {
          + name   = "last-dram-dynamodb-policy"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "dynamodb:*",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:dynamodb:us-east-1:062130427086:table/Bottles",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

  # aws_s3_bucket.cdn_bucket has changed
  ~ resource "aws_s3_bucket" "cdn_bucket" {
        id                                   = "last-dram-cdn"
        tags                                 = {}
        # (18 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_dynamodb_table.user-bottles-table will be created
  + resource "aws_dynamodb_table" "user-bottles-table" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "UserBottles"
      + read_capacity    = 20
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = 20

      + attribute {
          + name = "id"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = (known after apply)
          + enabled        = (known after apply)
        }
    }

  # aws_s3_bucket.cdn_bucket will be destroyed
  # (because aws_s3_bucket.cdn_bucket is not in configuration)
  - resource "aws_s3_bucket" "cdn_bucket" {
      - acl                                  = "private" -> null
      - arn                                  = "arn:aws:s3:::last-dram-cdn" -> null
      - bucket                               = "last-dram-cdn" -> null
      - bucket_domain_name                   = "last-dram-cdn.s3.amazonaws.com" -> null
      - bucket_regional_domain_name          = "last-dram-cdn.s3.amazonaws.com" -> null
      - cors_rule                            = [] -> null
      - force_destroy                        = false -> null
      - grant                                = [] -> null
      - hosted_zone_id                       = "Z3AQBSTGFYJSTF" -> null
      - id                                   = "last-dram-cdn" -> null
      - lifecycle_rule                       = [] -> null
      - logging                              = [] -> null
      - region                               = "us-east-1" -> null
      - replication_configuration            = [] -> null
      - request_payer                        = "BucketOwner" -> null
      - server_side_encryption_configuration = [] -> null
      - tags                                 = {} -> null
      - tags_all                             = {} -> null
      - versioning                           = [
          - {
              - enabled    = false
              - mfa_delete = false
            },
        ] -> null
      - website                              = [] -> null
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>